backend/app/app/tests/crud/_utils/cassettes/TestStripe.test_create_checkout_session.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      User-Agent:
      - Stripe/v1 PythonBindings/2.60.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_8oQR4xXHepoGFj", "request_duration_ms":
        402}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.60.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.2", "platform": "Linux-5.10.49-1-MANJARO-x86_64-with-glibc2.2.5",
        "uname": "Linux aa5c70fc2c12 5.10.49-1-MANJARO #1 SMP PREEMPT Sun Jul 11 12:59:43
        UTC 2021 x86_64 "}'
      authorization:
      - DUMMY
    method: GET
    uri: https://api.stripe.com/v1/prices?lookup_keys%5B0%5D=no_plan&lookup_keys%5B1%5D=trial_expired&lookup_keys%5B2%5D=free&lookup_keys%5B3%5D=lite&lookup_keys%5B4%5D=medium&lookup_keys%5B5%5D=enterprise&lookup_keys%5B6%5D=cancelled
  response:
    body:
      string: "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"price_1JFnKrISAshlKrRgdPcdclQ9\",\n
        \     \"object\": \"price\",\n      \"active\": true,\n      \"billing_scheme\":
        \"per_unit\",\n      \"created\": 1626904333,\n      \"currency\": \"eur\",\n
        \     \"livemode\": false,\n      \"lookup_key\": \"enterprise\",\n      \"metadata\":
        {\n      },\n      \"nickname\": null,\n      \"product\": \"prod_JtaVPrC8nroNHr\",\n
        \     \"recurring\": {\n        \"aggregate_usage\": null,\n        \"interval\":
        \"month\",\n        \"interval_count\": 1,\n        \"trial_period_days\":
        null,\n        \"usage_type\": \"licensed\"\n      },\n      \"tax_behavior\":
        \"unspecified\",\n      \"tiers_mode\": null,\n      \"transform_quantity\":
        null,\n      \"type\": \"recurring\",\n      \"unit_amount\": 4900,\n      \"unit_amount_decimal\":
        \"4900\"\n    },\n    {\n      \"id\": \"price_1JFnKPISAshlKrRgQ3RTCFiO\",\n
        \     \"object\": \"price\",\n      \"active\": true,\n      \"billing_scheme\":
        \"per_unit\",\n      \"created\": 1626904305,\n      \"currency\": \"eur\",\n
        \     \"livemode\": false,\n      \"lookup_key\": \"lite\",\n      \"metadata\":
        {\n      },\n      \"nickname\": null,\n      \"product\": \"prod_JtaVoLzg2hQ3rf\",\n
        \     \"recurring\": {\n        \"aggregate_usage\": null,\n        \"interval\":
        \"month\",\n        \"interval_count\": 1,\n        \"trial_period_days\":
        null,\n        \"usage_type\": \"licensed\"\n      },\n      \"tax_behavior\":
        \"unspecified\",\n      \"tiers_mode\": null,\n      \"transform_quantity\":
        null,\n      \"type\": \"recurring\",\n      \"unit_amount\": 500,\n      \"unit_amount_decimal\":
        \"500\"\n    },\n    {\n      \"id\": \"price_1JFnKfISAshlKrRgGSXXMHHy\",\n
        \     \"object\": \"price\",\n      \"active\": true,\n      \"billing_scheme\":
        \"per_unit\",\n      \"created\": 1626904321,\n      \"currency\": \"eur\",\n
        \     \"livemode\": false,\n      \"lookup_key\": \"medium\",\n      \"metadata\":
        {\n      },\n      \"nickname\": null,\n      \"product\": \"prod_JtaVCSClv3JOfb\",\n
        \     \"recurring\": {\n        \"aggregate_usage\": null,\n        \"interval\":
        \"month\",\n        \"interval_count\": 1,\n        \"trial_period_days\":
        null,\n        \"usage_type\": \"licensed\"\n      },\n      \"tax_behavior\":
        \"unspecified\",\n      \"tiers_mode\": null,\n      \"transform_quantity\":
        null,\n      \"type\": \"recurring\",\n      \"unit_amount\": 1900,\n      \"unit_amount_decimal\":
        \"1900\"\n    }\n  ],\n  \"has_more\": false,\n  \"url\": \"/v1/prices\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '2243'
      Content-Type:
      - application/json
      Date:
      - Tue, 03 Aug 2021 19:55:00 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_AWPtzmQ3D98dhK
      stripe-version:
      - '2020-08-27'
      x-stripe-c-cost:
      - '0'
    status:
      code: 200
      message: OK
- request:
    body: success_url=http%3A%2F%2Flocalhost%2Fmain%2Ftransaction%2Fsuccess&cancel_url=http%3A%2F%2Flocalhost%2Fmain%2Ftransaction%2Fcancelled&customer=cus_JyQYOl2zHrlL7r&payment_method_types[0]=card&mode=subscription&metadata[plan]=lite&line_items[0][price]=price_1JFnKPISAshlKrRgQ3RTCFiO&line_items[0][quantity]=1
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '305'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 6821a125-ad03-4345-9c58-b46d0945cac9
      User-Agent:
      - Stripe/v1 PythonBindings/2.60.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_AWPtzmQ3D98dhK", "request_duration_ms":
        368}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.60.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.2", "platform": "Linux-5.10.49-1-MANJARO-x86_64-with-glibc2.2.5",
        "uname": "Linux aa5c70fc2c12 5.10.49-1-MANJARO #1 SMP PREEMPT Sun Jul 11 12:59:43
        UTC 2021 x86_64 "}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/checkout/sessions
  response:
    body:
      string: "{\n  \"id\": \"cs_test_a1D9L0O6xFmRsb7WQVL64FeVbJFnV4KMcw3ZPaObrkHx1f0gRZt6owLP9G\",\n
        \ \"object\": \"checkout.session\",\n  \"allow_promotion_codes\": null,\n
        \ \"amount_subtotal\": 500,\n  \"amount_total\": 500,\n  \"automatic_tax\":
        {\n    \"enabled\": false,\n    \"status\": null\n  },\n  \"billing_address_collection\":
        null,\n  \"cancel_url\": \"http://localhost/main/transaction/cancelled\",\n
        \ \"client_reference_id\": null,\n  \"currency\": \"eur\",\n  \"customer\":
        \"cus_JyQYOl2zHrlL7r\",\n  \"customer_details\": null,\n  \"customer_email\":
        null,\n  \"livemode\": false,\n  \"locale\": null,\n  \"metadata\": {\n    \"plan\":
        \"lite\"\n  },\n  \"mode\": \"subscription\",\n  \"payment_intent\": null,\n
        \ \"payment_method_options\": null,\n  \"payment_method_types\": [\n    \"card\"\n
        \ ],\n  \"payment_status\": \"unpaid\",\n  \"setup_intent\": null,\n  \"shipping\":
        null,\n  \"shipping_address_collection\": null,\n  \"submit_type\": null,\n
        \ \"subscription\": null,\n  \"success_url\": \"http://localhost/main/transaction/success\",\n
        \ \"total_details\": {\n    \"amount_discount\": 0,\n    \"amount_shipping\":
        0,\n    \"amount_tax\": 0\n  },\n  \"url\": \"https://checkout.stripe.com/pay/cs_test_a1D9L0O6xFmRsb7WQVL64FeVbJFnV4KMcw3ZPaObrkHx1f0gRZt6owLP9G#fidkdWxOYHwnPyd1blpxYHZxWjA0TGZ8b2ZMVkR2bWlOd1diXTJLYTcycUFQfTY9S1JRVmd2dERscFBCbG9XTnY9NUs9Sj1vY01ESExiaVZHdTNMc25nUXI1b19Ob3E0Nl0yMjF9dkNQNWQyNTVtUU1DUkNUNScpJ2N3amhWYHdzYHcnP3F3cGApJ2lkfGpwcVF8dWAnPyd2bGtiaWBabHFgaCcpJ2BrZGdpYFVpZGZgbWppYWB3dic%2FcXdwYHgl\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1404'
      Content-Type:
      - application/json
      Date:
      - Tue, 03 Aug 2021 19:55:00 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - 6821a125-ad03-4345-9c58-b46d0945cac9
      original-request:
      - req_XNSBKCgCqB0y8b
      request-id:
      - req_XNSBKCgCqB0y8b
      stripe-should-retry:
      - 'false'
      stripe-version:
      - '2020-08-27'
      x-stripe-c-cost:
      - '1'
    status:
      code: 200
      message: OK
version: 1
