backend/app/app/tests/crud/_utils/cassettes/TestStripe.test_cancel_subscription.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      User-Agent:
      - Stripe/v1 PythonBindings/2.60.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_VwtrGEheO642Lc", "request_duration_ms":
        248}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.60.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.2", "platform": "Linux-5.10.49-1-MANJARO-x86_64-with-glibc2.2.5",
        "uname": "Linux aa5c70fc2c12 5.10.49-1-MANJARO #1 SMP PREEMPT Sun Jul 11 12:59:43
        UTC 2021 x86_64 "}'
      authorization:
      - DUMMY
    method: GET
    uri: https://api.stripe.com/v1/subscriptions?customer=cus_JvRpCCzaOdKoVk
  response:
    body:
      string: "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"sub_JvRpb0t6jUNTDE\",\n
        \     \"object\": \"subscription\",\n      \"application_fee_percent\": null,\n
        \     \"automatic_tax\": {\n        \"enabled\": false\n      },\n      \"billing_cycle_anchor\":
        1628542917,\n      \"billing_thresholds\": null,\n      \"cancel_at\": null,\n
        \     \"cancel_at_period_end\": false,\n      \"canceled_at\": null,\n      \"collection_method\":
        \"charge_automatically\",\n      \"created\": 1627333317,\n      \"current_period_end\":
        1628542917,\n      \"current_period_start\": 1627333317,\n      \"customer\":
        \"cus_JvRpCCzaOdKoVk\",\n      \"days_until_due\": null,\n      \"default_payment_method\":
        null,\n      \"default_source\": null,\n      \"default_tax_rates\": [\n\n
        \     ],\n      \"discount\": null,\n      \"ended_at\": null,\n      \"items\":
        {\n        \"object\": \"list\",\n        \"data\": [\n          {\n            \"id\":
        \"si_JvRpmF17yAELlb\",\n            \"object\": \"subscription_item\",\n            \"billing_thresholds\":
        null,\n            \"created\": 1627333318,\n            \"metadata\": {\n
        \           },\n            \"plan\": {\n              \"id\": \"price_1JFnKrISAshlKrRgdPcdclQ9\",\n
        \             \"object\": \"plan\",\n              \"active\": true,\n              \"aggregate_usage\":
        null,\n              \"amount\": 4900,\n              \"amount_decimal\":
        \"4900\",\n              \"billing_scheme\": \"per_unit\",\n              \"created\":
        1626904333,\n              \"currency\": \"eur\",\n              \"interval\":
        \"month\",\n              \"interval_count\": 1,\n              \"livemode\":
        false,\n              \"metadata\": {\n              },\n              \"nickname\":
        null,\n              \"product\": \"prod_JtaVPrC8nroNHr\",\n              \"tiers_mode\":
        null,\n              \"transform_usage\": null,\n              \"trial_period_days\":
        null,\n              \"usage_type\": \"licensed\"\n            },\n            \"price\":
        {\n              \"id\": \"price_1JFnKrISAshlKrRgdPcdclQ9\",\n              \"object\":
        \"price\",\n              \"active\": true,\n              \"billing_scheme\":
        \"per_unit\",\n              \"created\": 1626904333,\n              \"currency\":
        \"eur\",\n              \"livemode\": false,\n              \"lookup_key\":
        \"enterprise\",\n              \"metadata\": {\n              },\n              \"nickname\":
        null,\n              \"product\": \"prod_JtaVPrC8nroNHr\",\n              \"recurring\":
        {\n                \"aggregate_usage\": null,\n                \"interval\":
        \"month\",\n                \"interval_count\": 1,\n                \"trial_period_days\":
        null,\n                \"usage_type\": \"licensed\"\n              },\n              \"tiers_mode\":
        null,\n              \"transform_quantity\": null,\n              \"type\":
        \"recurring\",\n              \"unit_amount\": 4900,\n              \"unit_amount_decimal\":
        \"4900\"\n            },\n            \"quantity\": 1,\n            \"subscription\":
        \"sub_JvRpb0t6jUNTDE\",\n            \"tax_rates\": [\n\n            ]\n          }\n
        \       ],\n        \"has_more\": false,\n        \"total_count\": 1,\n        \"url\":
        \"/v1/subscription_items?subscription=sub_JvRpb0t6jUNTDE\"\n      },\n      \"latest_invoice\":
        \"in_1JHavxISAshlKrRgNJYC0qWp\",\n      \"livemode\": false,\n      \"metadata\":
        {\n      },\n      \"next_pending_invoice_item_invoice\": null,\n      \"pause_collection\":
        null,\n      \"payment_settings\": {\n        \"payment_method_options\":
        null,\n        \"payment_method_types\": null\n      },\n      \"pending_invoice_item_interval\":
        null,\n      \"pending_setup_intent\": \"seti_1JHavxISAshlKrRghXv4o7eY\",\n
        \     \"pending_update\": null,\n      \"plan\": {\n        \"id\": \"price_1JFnKrISAshlKrRgdPcdclQ9\",\n
        \       \"object\": \"plan\",\n        \"active\": true,\n        \"aggregate_usage\":
        null,\n        \"amount\": 4900,\n        \"amount_decimal\": \"4900\",\n
        \       \"billing_scheme\": \"per_unit\",\n        \"created\": 1626904333,\n
        \       \"currency\": \"eur\",\n        \"interval\": \"month\",\n        \"interval_count\":
        1,\n        \"livemode\": false,\n        \"metadata\": {\n        },\n        \"nickname\":
        null,\n        \"product\": \"prod_JtaVPrC8nroNHr\",\n        \"tiers_mode\":
        null,\n        \"transform_usage\": null,\n        \"trial_period_days\":
        null,\n        \"usage_type\": \"licensed\"\n      },\n      \"quantity\":
        1,\n      \"schedule\": null,\n      \"start_date\": 1627333317,\n      \"status\":
        \"trialing\",\n      \"transfer_data\": null,\n      \"trial_end\": 1628542917,\n
        \     \"trial_start\": 1627333317\n    }\n  ],\n  \"has_more\": false,\n  \"url\":
        \"/v1/subscriptions\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '4291'
      Content-Type:
      - application/json
      Date:
      - Mon, 26 Jul 2021 21:01:58 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_Z5r0IQ2CvLDt94
      stripe-version:
      - '2020-08-27'
      x-stripe-c-cost:
      - '0'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '0'
      User-Agent:
      - Stripe/v1 PythonBindings/2.60.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_Z5r0IQ2CvLDt94", "request_duration_ms":
        359}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.60.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.8.2", "platform": "Linux-5.10.49-1-MANJARO-x86_64-with-glibc2.2.5",
        "uname": "Linux aa5c70fc2c12 5.10.49-1-MANJARO #1 SMP PREEMPT Sun Jul 11 12:59:43
        UTC 2021 x86_64 "}'
      authorization:
      - DUMMY
    method: DELETE
    uri: https://api.stripe.com/v1/subscriptions/sub_JvRpb0t6jUNTDE
  response:
    body:
      string: "{\n  \"id\": \"sub_JvRpb0t6jUNTDE\",\n  \"object\": \"subscription\",\n
        \ \"application_fee_percent\": null,\n  \"automatic_tax\": {\n    \"enabled\":
        false\n  },\n  \"billing_cycle_anchor\": 1628542917,\n  \"billing_thresholds\":
        null,\n  \"cancel_at\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\":
        1627333319,\n  \"collection_method\": \"charge_automatically\",\n  \"created\":
        1627333317,\n  \"current_period_end\": 1628542917,\n  \"current_period_start\":
        1627333317,\n  \"customer\": \"cus_JvRpCCzaOdKoVk\",\n  \"days_until_due\":
        null,\n  \"default_payment_method\": null,\n  \"default_source\": null,\n
        \ \"default_tax_rates\": [\n\n  ],\n  \"discount\": null,\n  \"ended_at\":
        1627333319,\n  \"items\": {\n    \"object\": \"list\",\n    \"data\": [\n
        \     {\n        \"id\": \"si_JvRpmF17yAELlb\",\n        \"object\": \"subscription_item\",\n
        \       \"billing_thresholds\": null,\n        \"created\": 1627333318,\n
        \       \"metadata\": {\n        },\n        \"plan\": {\n          \"id\":
        \"price_1JFnKrISAshlKrRgdPcdclQ9\",\n          \"object\": \"plan\",\n          \"active\":
        true,\n          \"aggregate_usage\": null,\n          \"amount\": 4900,\n
        \         \"amount_decimal\": \"4900\",\n          \"billing_scheme\": \"per_unit\",\n
        \         \"created\": 1626904333,\n          \"currency\": \"eur\",\n          \"interval\":
        \"month\",\n          \"interval_count\": 1,\n          \"livemode\": false,\n
        \         \"metadata\": {\n          },\n          \"nickname\": null,\n          \"product\":
        \"prod_JtaVPrC8nroNHr\",\n          \"tiers_mode\": null,\n          \"transform_usage\":
        null,\n          \"trial_period_days\": null,\n          \"usage_type\": \"licensed\"\n
        \       },\n        \"price\": {\n          \"id\": \"price_1JFnKrISAshlKrRgdPcdclQ9\",\n
        \         \"object\": \"price\",\n          \"active\": true,\n          \"billing_scheme\":
        \"per_unit\",\n          \"created\": 1626904333,\n          \"currency\":
        \"eur\",\n          \"livemode\": false,\n          \"lookup_key\": \"enterprise\",\n
        \         \"metadata\": {\n          },\n          \"nickname\": null,\n          \"product\":
        \"prod_JtaVPrC8nroNHr\",\n          \"recurring\": {\n            \"aggregate_usage\":
        null,\n            \"interval\": \"month\",\n            \"interval_count\":
        1,\n            \"trial_period_days\": null,\n            \"usage_type\":
        \"licensed\"\n          },\n          \"tiers_mode\": null,\n          \"transform_quantity\":
        null,\n          \"type\": \"recurring\",\n          \"unit_amount\": 4900,\n
        \         \"unit_amount_decimal\": \"4900\"\n        },\n        \"quantity\":
        1,\n        \"subscription\": \"sub_JvRpb0t6jUNTDE\",\n        \"tax_rates\":
        [\n\n        ]\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\":
        1,\n    \"url\": \"/v1/subscription_items?subscription=sub_JvRpb0t6jUNTDE\"\n
        \ },\n  \"latest_invoice\": \"in_1JHavxISAshlKrRgNJYC0qWp\",\n  \"livemode\":
        false,\n  \"metadata\": {\n  },\n  \"next_pending_invoice_item_invoice\":
        null,\n  \"pause_collection\": null,\n  \"payment_settings\": {\n    \"payment_method_options\":
        null,\n    \"payment_method_types\": null\n  },\n  \"pending_invoice_item_interval\":
        null,\n  \"pending_setup_intent\": \"seti_1JHavxISAshlKrRghXv4o7eY\",\n  \"pending_update\":
        null,\n  \"plan\": {\n    \"id\": \"price_1JFnKrISAshlKrRgdPcdclQ9\",\n    \"object\":
        \"plan\",\n    \"active\": true,\n    \"aggregate_usage\": null,\n    \"amount\":
        4900,\n    \"amount_decimal\": \"4900\",\n    \"billing_scheme\": \"per_unit\",\n
        \   \"created\": 1626904333,\n    \"currency\": \"eur\",\n    \"interval\":
        \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\":
        {\n    },\n    \"nickname\": null,\n    \"product\": \"prod_JtaVPrC8nroNHr\",\n
        \   \"tiers_mode\": null,\n    \"transform_usage\": null,\n    \"trial_period_days\":
        null,\n    \"usage_type\": \"licensed\"\n  },\n  \"quantity\": 1,\n  \"schedule\":
        null,\n  \"start_date\": 1627333317,\n  \"status\": \"canceled\",\n  \"transfer_data\":
        null,\n  \"trial_end\": 1628542917,\n  \"trial_start\": 1627333317\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '3672'
      Content-Type:
      - application/json
      Date:
      - Mon, 26 Jul 2021 21:01:59 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_m4BoxtToH9Flfb
      stripe-version:
      - '2020-08-27'
      x-stripe-c-cost:
      - '0'
    status:
      code: 200
      message: OK
version: 1
